ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper.c
/**
 ******************************************************************************
 * @file    stm32f4xx_i2c_helper.c
 * @author  Federico Iannucci - SE4
 * @version V0.3
 * @date    17-April-2015
 * @brief   I2C Helper Module
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_i2c_helper.h"

/** @addtogroup STM32F4xx_Helper_Library
 * @{
 */

/** @addtogroup I2C_Helper
 * @{
 */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @addtogroup I2C_Helper_Private_Defines Private Defines
 * @{
 */

/** @addtogroup I2C_Helper_Private_Defines_Group1 Interrupt Flags
 * @brief Interrupt flags.
 * @{
 */
#ifndef I2C_HELPER_I2C1_EV_IT_ENABLE
#define I2C_HELPER_I2C1_EV_IT_ENABLE 0
#endif
#ifndef I2C_HELPER_I2C1_ER_IT_ENABLE
#define I2C_HELPER_I2C1_ER_IT_ENABLE 0
#endif

#ifndef I2C_HELPER_I2C2_EV_IT_ENABLE
#define I2C_HELPER_I2C2_EV_IT_ENABLE 0
#endif
#ifndef I2C_HELPER_I2C2_ER_IT_ENABLE
#define I2C_HELPER_I2C2_ER_IT_ENABLE 0
#endif

#ifndef I2C_HELPER_I2C3_EV_IT_ENABLE
#define I2C_HELPER_I2C3_EV_IT_ENABLE 0
#endif
#ifndef I2C_HELPER_I2C3_ER_IT_ENABLE
#define I2C_HELPER_I2C3_ER_IT_ENABLE 0
#endif

/**
 * @}
 */

/** @addtogroup I2C_Helper_Private_Defines_Group2 DMA Flags
 * @brief Interrupt flags.
 * @{
 */
#ifndef I2C_HELPER_I2C1_DMA_ENABLE
#define I2C_HELPER_I2C1_DMA_ENABLE 0
#endif

#ifndef I2C_HELPER_I2C2_DMA_ENABLE
#define I2C_HELPER_I2C2_DMA_ENABLE 0
#endif

#ifndef I2C_HELPER_I2C3_DMA_ENABLE
#define I2C_HELPER_I2C3_DMA_ENABLE 0
#endif

/**
 * @}
 */

/**
 * @}
 */

/* Private macro -------------------------------------------------------------*/

/** @addtogroup I2C_Helper_Private_Macros Private Macros
 * @{
 */
#define HELPER_I2C_UNUSED  __attribute__((unused))

/**
 * @}
 */

/* Private variables ---------------------------------------------------------*/
/** @addtogroup I2C_Helper_Private_Variables Private Variables
 * @{
 */

/** @addtogroup I2C_Helper_Private_Variables_Group1 I2C Handlers
 * @brief Peripheral handlers.
 * @{
 */
static I2C_HandleTypeDef HELPER_I2C1_Handle; /*!< Handler for the I2C1 peripheral */
static I2C_HandleTypeDef HELPER_I2C2_Handle; /*!< Handler for the I2C2 peripheral */
static I2C_HandleTypeDef HELPER_I2C3_Handle; /*!< Handler for the I2C3 peripheral */

/**
 * @}
 */

/** @addtogroup I2C_Helper_Private_Variables_Group2 DMA Handlers
 * @brief DMA handlers.
 * @{
 */
static DMA_HandleTypeDef  HELPER_I2C1_hdma_tx HELPER_I2C_UNUSED; /* Transmission */
static DMA_HandleTypeDef HELPER_I2C1_hdma_rx HELPER_I2C_UNUSED; /* Reception */
static DMA_HandleTypeDef HELPER_I2C2_hdma_tx HELPER_I2C_UNUSED; /* Transmission */
static DMA_HandleTypeDef HELPER_I2C2_hdma_rx HELPER_I2C_UNUSED; /* Reception */
static DMA_HandleTypeDef HELPER_I2C3_hdma_tx HELPER_I2C_UNUSED; /* Transmission */
static DMA_HandleTypeDef HELPER_I2C3_hdma_rx HELPER_I2C_UNUSED; /* Reception */

/**
 * @}
 */

/**
 * @}
 */
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/** @defgroup I2C_Helper_Private_Functions Weak Implemented Functions
 * @ IRQ Handlers, MspInit and MspDeInit.
 * @{
 */

/** @defgroup I2C_Helper_IRQ_Handler IRQ Handlers
 * @{
 */

/* IRQ Handlers -------------------------------------------------------------*/
#if (I2C_HELPER_I2C1_EV_IT_ENABLE == 1)
/**
 * @brief Event Handler for the I2C1 component.
 */
void I2C1_EV_IRQHandler()
{
	//HAL_I2C_EV_IRQHandler(&HELPER_I2C1_Handle);
	I2C_HELPER_EV_IRQHandler(&HELPER_I2C1_Handle);
}
#endif

#if (I2C_HELPER_I2C1_ER_IT_ENABLE == 1)
/**
 * @brief Error Handler for the I2C1 component.
 */
void I2C1_ER_IRQHandler()
{
	//HAL_I2C_ER_IRQHandler(&HELPER_I2C1_Handle);
	I2C_HELPER_ER_IRQHandler(&HELPER_I2C1_Handle);
}
#endif

#if (I2C_HELPER_I2C2_EV_IT_ENABLE == 1)
/**
 * @brief Event Handler for the I2C2 component.
 */
void I2C2_EV_IRQHandler()
{
	//HAL_I2C_EV_IRQHandler(&HELPER_I2C2_Handle);
	I2C_HELPER_EV_IRQHandler(&HELPER_I2C2_Handle);
}
#endif

#if (I2C_HELPER_I2C2_ER_IT_ENABLE == 1)
/**
 * @brief Error Handler for the I2C2 component.
 */
void I2C2_ER_IRQHandler()
{
	//HAL_I2C_ER_IRQHandler(&HELPER_I2C2_Handle);
	I2C_HELPER_ER_IRQHandler(&HELPER_I2C2_Handle);
}
#endif

#if (I2C_HELPER_I2C3_EV_IT_ENABLE == 1)
/**
 * @brief Event Handler for the I2C3 component.
 */
void I2C3_EV_IRQHandler()
{
	//HAL_I2C_EV_IRQHandler(&HELPER_I2C3_Handle);
	I2C_HELPER_EV_IRQHandler(&HELPER_I2C3_Handle);
}
#endif

#if (I2C_HELPER_I2C3_ER_IT_ENABLE == 1)
/**
 * @brief Error Handler for the I2C3 component.
 */
void I2C3_ER_IRQHandler()
{
	//HAL_I2C_ER_IRQHandler(&HELPER_I2C3_Handle);
	I2C_HELPER_ER_IRQHandler(&HELPER_I2C3_Handle);
}
#endif

/**
 * @}
 */

