ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper.c
/** @defgroup I2C_Helper_IRQ_Handler DMA IRQ Handlers
 * @{
 */

#if (I2C_HELPER_I2C1_DMA_TX_ENABLE == 1)
/**
 * @brief This function handle DMA Interrupt
 */
void I2C_HELPER_I2C1_DMA_TX_IRQHandler()
{
	HAL_DMA_IRQHandler(HELPER_I2C1_Handle.hdmatx);
}
#endif

#if (I2C_HELPER_I2C1_DMA_RX_ENABLE == 1)
/**
 * @brief This function handle DMA Interrupt
 */
void I2C_HELPER_I2C1_DMA_RX_IRQHandler()
{
	HAL_DMA_IRQHandler(HELPER_I2C1_Handle.hdmarx);
}
#endif

#if (I2C_HELPER_I2C2_DMA_TX_ENABLE == 1)
/**
 * @brief This function handle DMA Interrupt
 */
void I2C_HELPER_I2C2_DMA_TX_IRQHandler()
{
	HAL_DMA_IRQHandler(HELPER_I2C2_Handle.hdmatx);
}
#endif

#if (I2C_HELPER_I2C2_DMA_RX_ENABLE == 1)
/**
 * @brief This function handle DMA Interrupt
 */
void I2C_HELPER_I2C2_DMA_RX_IRQHandler()
{
	HAL_DMA_IRQHandler(HELPER_I2C2_Handle.hdmarx);
}
#endif

#if (I2C_HELPER_I2C3_DMA_TX_ENABLE == 1)
/**
 * @brief This function handle DMA Interrupt
 */
void I2C_HELPER_I2C3_DMA_TX_IRQHandler()
{
	HAL_DMA_IRQHandler(HELPER_I2C3_Handle.hdmatx);
}
#endif

#if (I2C_HELPER_I2C3_DMA_RX_ENABLE == 1)
/**
 * @brief This function handle DMA Interrupt
 */
void I2C_HELPER_I2C3_DMA_RX_IRQHandler()
{
	HAL_DMA_IRQHandler(HELPER_I2C3_Handle.hdmarx);
}
#endif

/**
 * @}
 */

/**@addtogroup I2C_Helper_Init_Functions Initialization Functions
 * @{
 */

/**
 * @brief I2C MSP Initialization
 *        This function configures the hardware resources used:
 *           - Peripheral's clock enable
 *           - Peripheral's GPIO Configuration
 *           - DMA configuration for transmission request by peripheral
 *           - NVIC configuration for DMA interrupt request enable
 *        This function is called by HAL_i2C_Init.
 * @param hi2c: I2C handle pointer
 * @retval None
 */
void HAL_I2C_MspInit(I2C_HandleTypeDef *hi2c)
{
	GPIO_InitTypeDef GPIO_InitStruct;

	if (hi2c->Instance == I2C1)
	{
		/*##-1- Enable GPIO Clocks #################################################*/
		/* Enable GPIO SDA/SCL clock */
		I2C_HELPER_I2C1_SDA_GPIO_CLK_ENABLE();
		I2C_HELPER_I2C1_SCL_GPIO_CLK_ENABLE();

		/*##-2- Configure peripheral GPIO ##########################################*/
		/* I2C SCL GPIO pin configuration  */
		GPIO_InitStruct.Pin = I2C_HELPER_I2C1_SCL_GPIO_PIN; /* Which pin */
		GPIO_InitStruct.Mode = GPIO_MODE_AF_OD; /* The Mode MUST BE OpenDrain */
		GPIO_InitStruct.Pull = GPIO_PULLUP;
		GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
		GPIO_InitStruct.Alternate = I2C_HELPER_I2C1_SCL_GPIO_AF;
		HAL_GPIO_Init(I2C_HELPER_I2C1_SCL_GPIO_PORT, &GPIO_InitStruct);

		/* I2C SDA GPIO pin configuration  */
		GPIO_InitStruct.Pin = I2C_HELPER_I2C1_SDA_GPIO_PIN;
		GPIO_InitStruct.Alternate = I2C_HELPER_I2C1_SDA_GPIO_AF;
		HAL_GPIO_Init(I2C_HELPER_I2C1_SDA_GPIO_PORT, &GPIO_InitStruct);

		/*##-3- Configure the DMA streams ##########################################*/
#if (I2C_HELPER_I2C1_DMA_TX_ENABLE == 1)
		/* Enable DMA1 clock */
		I2C_HELPER_I2Cx_DMA_CLK_ENABLE();

		/* Configure the DMA handler for Transmission process */
		HELPER_I2C1_hdma_tx.Instance = I2C_HELPER_I2C1_DMA_TX_STREAM;

		HELPER_I2C1_hdma_tx.Init.Channel = I2C_HELPER_I2C1_DMA_TX_CHANNEL;
		HELPER_I2C1_hdma_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
		HELPER_I2C1_hdma_tx.Init.PeriphInc = DMA_PINC_DISABLE;
		HELPER_I2C1_hdma_tx.Init.MemInc = DMA_MINC_ENABLE;
		HELPER_I2C1_hdma_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
		HELPER_I2C1_hdma_tx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
		HELPER_I2C1_hdma_tx.Init.Mode = DMA_NORMAL;
		HELPER_I2C1_hdma_tx.Init.Priority = DMA_PRIORITY_LOW;
		HELPER_I2C1_hdma_tx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
		HELPER_I2C1_hdma_tx.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
		HELPER_I2C1_hdma_tx.Init.MemBurst = DMA_MBURST_INC4;
		HELPER_I2C1_hdma_tx.Init.PeriphBurst = DMA_PBURST_INC4;

		HAL_DMA_Init(&HELPER_I2C1_hdma_tx);

		/* Associate the initialized DMA handle to the the I2C handle */
		__HAL_LINKDMA(hi2c, hdmatx, HELPER_I2C1_hdma_tx);

		/*##-3.1- Configure the NVIC for DMA #########################################*/
		/* NVIC configuration for DMA transfer complete interrupt (I2C1_TX) */
		HAL_NVIC_SetPriority(I2C_HELPER_I2C1_DMA_TX_IRQn,
		I2C_HELPER_I2C1_DMA_TX_PRIORITY,
		I2C_HELPER_I2C1_DMA_TX_SUBPRIORITY);
		HAL_NVIC_EnableIRQ(I2C_HELPER_I2C1_DMA_TX_IRQn);
#endif
#if (I2C_HELPER_I2C1_DMA_RX_ENABLE == 1)
		/* Enable DMA1 clock */
		I2C_HELPER_I2Cx_DMA_CLK_ENABLE();

		/* Configure the DMA handler for Transmission process */
		HELPER_I2C1_hdma_rx.Instance = I2C_HELPER_I2C1_DMA_RX_STREAM;

		HELPER_I2C1_hdma_rx.Init.Channel = I2C_HELPER_I2C1_DMA_RX_CHANNEL;
		HELPER_I2C1_hdma_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
		HELPER_I2C1_hdma_rx.Init.PeriphInc = DMA_PINC_DISABLE;
		HELPER_I2C1_hdma_rx.Init.MemInc = DMA_MINC_ENABLE;
		HELPER_I2C1_hdma_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
		HELPER_I2C1_hdma_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
		HELPER_I2C1_hdma_rx.Init.Mode = DMA_NORMAL;
		HELPER_I2C1_hdma_rx.Init.Priority = DMA_PRIORITY_HIGH;
		HELPER_I2C1_hdma_rx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
		HELPER_I2C1_hdma_rx.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
		HELPER_I2C1_hdma_rx.Init.MemBurst = DMA_MBURST_INC4;
		HELPER_I2C1_hdma_rx.Init.PeriphBurst = DMA_PBURST_INC4;

		HAL_DMA_Init(&HELPER_I2C1_hdma_rx);

		/* Associate the initialized DMA handle to the the I2C handle */
		__HAL_LINKDMA(hi2c, hdmarx, HELPER_I2C1_hdma_rx);

		/*##-3.1- Configure the NVIC for DMA #########################################*/
		/* NVIC configuration for DMA transfer complete interrupt (I2C1_RX) */
		HAL_NVIC_SetPriority(I2C_HELPER_I2C1_DMA_RX_IRQn,
				I2C_HELPER_I2C1_DMA_RX_PRIORITY,
				I2C_HELPER_I2C1_DMA_RX_SUBPRIORITY);
		HAL_NVIC_EnableIRQ(I2C_HELPER_I2C1_DMA_RX_IRQn);
#endif
		/*##-4- Enable I2C peripheral Clock ########################################*/
		/* Enable I2C1 clock */
		I2C_HELPER_I2C1_CLK_ENABLE();

