ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper.c
		HAL_DMA_Init(&HELPER_I2C3_hdma_tx);

		/* Associate the initialized DMA handle to the the I2C handle */
		__HAL_LINKDMA(hi2c, hdmatx, HELPER_I2C3_hdma_tx);

		/*##-3.1- Configure the NVIC for DMA #########################################*/
		/* NVIC configuration for DMA transfer complete interrupt (I2C1_TX) */
		HAL_NVIC_SetPriority(I2C_HELPER_I2C3_DMA_TX_IRQn,
				I2C_HELPER_I2C3_DMA_TX_PRIORITY,
				I2C_HELPER_I2C3_DMA_TX_SUBPRIORITY);
		HAL_NVIC_EnableIRQ(I2C_HELPER_I2C3_DMA_TX_IRQn);
#endif
#if (I2C_HELPER_I2C3_DMA_RX_ENABLE == 1)
		/* Configure the DMA handler for Transmission process */
		HELPER_I2C3_hdma_rx.Instance = I2C_HELPER_I2C3_DMA_RX_STREAM;

		HELPER_I2C3_hdma_rx.Init.Channel = I2C_HELPER_I2C3_DMA_RX_CHANNEL;
		HELPER_I2C3_hdma_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
		HELPER_I2C3_hdma_rx.Init.PeriphInc = DMA_PINC_DISABLE;
		HELPER_I2C3_hdma_rx.Init.MemInc = DMA_MINC_ENABLE;
		HELPER_I2C3_hdma_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
		HELPER_I2C3_hdma_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
		HELPER_I2C3_hdma_rx.Init.Mode = DMA_NORMAL;
		HELPER_I2C3_hdma_rx.Init.Priority = DMA_PRIORITY_HIGH;
		HELPER_I2C3_hdma_rx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
		HELPER_I2C3_hdma_rx.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
		HELPER_I2C3_hdma_rx.Init.MemBurst = DMA_MBURST_INC4;
		HELPER_I2C3_hdma_rx.Init.PeriphBurst = DMA_PBURST_INC4;

		HAL_DMA_Init(&HELPER_I2C3_hdma_rx);

		/* Associate the initialized DMA handle to the the I2C handle */
		__HAL_LINKDMA(hi2c, hdmarx, HELPER_I2C3_hdma_rx);

		/*##-3.1- Configure the NVIC for DMA #########################################*/
		/* NVIC configuration for DMA transfer complete interrupt (I2C1_RX) */
		HAL_NVIC_SetPriority(I2C_HELPER_I2C3_DMA_RX_IRQn, I2C_HELPER_I2C3_DMA_RX_PRIORITY, I2C_HELPER_I2C3_DMA_RX_SUBPRIORITY);
		HAL_NVIC_EnableIRQ(I2C_HELPER_I2C3_DMA_RX_IRQn);
#endif
		/*##-4- Enable I2C peripheral Clock ########################################*/
		/* Enable I2C3 clock */
		I2C_HELPER_I2C3_CLK_ENABLE();

		/*##-5- Enable interrupt #######################################*/
#if (I2C_HELPER_I2C3_EV_IT_ENABLE == 1)
		HAL_NVIC_SetPriority(I2C3_EV_IRQn, I2C_HELPER_I2C3_EV_IT_PRIORITY,
				I2C_HELPER_I2C3_EV_IT_PRIORITY);
		HAL_NVIC_EnableIRQ(I2C3_EV_IRQn);
#endif
#if (I2C_HELPER_I2C3_ER_IT_ENABLE == 1)
		HAL_NVIC_SetPriority(I2C3_ER_IRQn, I2C_HELPER_I2C3_ER_IT_PRIORITY,
				I2C_HELPER_I2C3_ER_IT_PRIORITY);
		HAL_NVIC_EnableIRQ(I2C3_ER_IRQn);
#endif
	}
}

/**
 * @brief I2C MSP De-Initialization
 *        This function frees the hardware resources used in this example:
 *          - Disable the Peripheral's clock
 *          - Revert GPIO, DMA and NVIC configuration to their default state
 * @param hi2c: I2C handle pointer
 * @retval None
 */
void HAL_I2C_MspDeInit(I2C_HandleTypeDef *hi2c)
{
	if (hi2c->Instance == I2C1)
	{
		/*##-1- Reset peripherals ##################################################*/
		I2C_HELPER_I2C1_FORCE_RESET();
		I2C_HELPER_I2C1_RELEASE_RESET();

		/*##-2- Disable peripherals and GPIO Clocks ################################*/
		/* Configure I2C Tx as alternate function  */
		HAL_GPIO_DeInit(I2C_HELPER_I2C1_SCL_GPIO_PORT,
		I2C_HELPER_I2C1_SCL_GPIO_PIN);
		/* Configure I2C Rx as alternate function  */
		HAL_GPIO_DeInit(I2C_HELPER_I2C1_SDA_GPIO_PORT,
		I2C_HELPER_I2C1_SDA_GPIO_PIN);

		/*##-3- Disable the NVIC for DMA ###########################################*/
		HAL_NVIC_DisableIRQ(I2C_HELPER_I2C1_DMA_TX_IRQn);
		HAL_NVIC_DisableIRQ(I2C_HELPER_I2C1_DMA_RX_IRQn);

		/*##-4- Disable interrupts ################################*/
#if (I2C_HELPER_I2C1_EV_IT_ENABLE == 1)
		HAL_NVIC_DisableIRQ(I2C1_EV_IRQn);
#endif
#if (I2C_HELPER_I2C1_ER_IT_ENABLE == 1)
		HAL_NVIC_DisableIRQ(I2C1_ER_IRQn);
#endif

	}
	else if (hi2c->Instance == I2C2)
	{
		/*##-1- Reset peripherals ##################################################*/
		I2C_HELPER_I2C2_FORCE_RESET();
		I2C_HELPER_I2C2_RELEASE_RESET();

		/*##-2- Disable peripherals and GPIO Clocks ################################*/
		/* Configure I2C Tx as alternate function  */
		HAL_GPIO_DeInit(I2C_HELPER_I2C2_SCL_GPIO_PORT,
		I2C_HELPER_I2C2_SCL_GPIO_PIN);
		/* Configure I2C Rx as alternate function  */
		HAL_GPIO_DeInit(I2C_HELPER_I2C2_SDA_GPIO_PORT,
		I2C_HELPER_I2C2_SDA_GPIO_PIN);

		/*##-3- Disable the NVIC for DMA ###########################################*/
		HAL_NVIC_DisableIRQ(I2C_HELPER_I2C2_DMA_TX_IRQn);
		HAL_NVIC_DisableIRQ(I2C_HELPER_I2C2_DMA_RX_IRQn);

		/*##-4- Disable interrupts ################################*/
#if (I2C_HELPER_I2C2_EV_IT_ENABLE == 1)
		HAL_NVIC_DisableIRQ(I2C2_EV_IRQn);
#endif
#if (I2C_HELPER_I2C2_ER_IT_ENABLE == 1)
		HAL_NVIC_DisableIRQ(I2C2_ER_IRQn);
#endif

	}
	else if (hi2c->Instance == I2C3)
	{
		/*##-1- Reset peripherals ##################################################*/
		I2C_HELPER_I2C3_FORCE_RESET();
		I2C_HELPER_I2C3_RELEASE_RESET();

		/*##-2- Disable peripherals and GPIO Clocks ################################*/
		/* Configure I2C Tx as alternate function  */
		HAL_GPIO_DeInit(I2C_HELPER_I2C3_SCL_GPIO_PORT,
		I2C_HELPER_I2C3_SCL_GPIO_PIN);
		/* Configure I2C Rx as alternate function  */
		HAL_GPIO_DeInit(I2C_HELPER_I2C3_SDA_GPIO_PORT,
		I2C_HELPER_I2C3_SDA_GPIO_PIN);

		/*##-3- Disable the NVIC for DMA ###########################################*/
		HAL_NVIC_DisableIRQ(I2C_HELPER_I2C3_DMA_TX_IRQn);
		HAL_NVIC_DisableIRQ(I2C_HELPER_I2C3_DMA_RX_IRQn);

		/*##-4- Disable interrupts ################################*/
#if (I2C_HELPER_I2C3_EV_IT_ENABLE == 1)
		HAL_NVIC_DisableIRQ(I2C3_EV_IRQn);
#endif
#if (I2C_HELPER_I2C3_ER_IT_ENABLE == 1)
		HAL_NVIC_DisableIRQ(I2C3_ER_IRQn);
#endif
	}

	/*##-5- Disable the DMA Streams ############################################*/
	/* De-Initialize the DMA Stream associate to transmission process */
	HAL_DMA_DeInit(hi2c->hdmatx);
	/* De-Initialize the DMA Stream associate to reception process */
	HAL_DMA_DeInit(hi2c->hdmatx);
}

/**
 * @}
 */

/* Public functions *************************************************************/
/** @addtogroup SPI_Helper_Exported_Functions Public Functions
 * @{
 */

/**
 * @brief	This function returns the internal managed handler for the I2C peripheral specified by the input parameter
 * @param	HELPER_I2Cx The internal handler's peripheral number
 * @return	The internal managed handler to the peripheral
 */
I2C_HandleTypeDef * HELPER_I2C_GetHandle(HELPER_I2C_TypeDef HELPER_I2Cx)
{
	switch (HELPER_I2Cx)
	{
	case HELPER_I2C1:
		return &HELPER_I2C1_Handle;
		break;
	case HELPER_I2C2:
		return &HELPER_I2C2_Handle;
		break;
	case HELPER_I2C3:
		return &HELPER_I2C3_Handle;
		break;
	default:
		return NULL;
	}
}

/**
 * @brief	This function returns the HELPER_I2C_TypeDef from an I2C_HandlerTypeDef
 * @param	hi2c The internal handler's peripheral number
 * @return	The internal managed handler to the peripheral
 */
HELPER_I2C_TypeDef HELPER_I2C_GetNum(I2C_HandleTypeDef* hi2c)
{

	if (hi2c->Instance == I2C1)
	{
		return HELPER_I2C1;
	}
	else if (hi2c->Instance == I2C2)
	{
		return HELPER_I2C2;
	}
	else if (hi2c->Instance == I2C3)
	{
		return HELPER_I2C3;
	}
	return NULL;
}

/**
 * @brief	This function initialize the peripheral according the configuration
 *			macros/defines specified into the stm32f4xx_i2c_helper_conf.h header file
 * @param	HELPER_I2Cx The internal handler's peripheral number
 * @return	A status specified by the HAL_StatusTypeDef
 */
HAL_StatusTypeDef HELPER_I2C_Init(HELPER_I2C_TypeDef HELPER_I2Cx)
{
	I2C_HandleTypeDef* handle = HELPER_I2C_GetHandle(HELPER_I2Cx);
	HAL_StatusTypeDef status;
	uint8_t enPEC = 0;

	switch (HELPER_I2Cx)
	{
	case HELPER_I2C1:
		handle->Instance = I2C1;
		handle->Init.ClockSpeed = I2C_HELPER_I2C1_CLOCK_SPEED;
		handle->Init.DutyCycle = I2C_HELPER_I2C1_DUTY_CYCLE;
		handle->Init.AddressingMode = I2C_HELPER_I2C1_ADDRESSING_MODE;
		handle->Init.OwnAddress1 = I2C_HELPER_I2C1_OWN_ADDRESS_1;
		handle->Init.DualAddressMode = I2C_HELPER_I2C1_DUAL_ADDRESSING;
		handle->Init.OwnAddress2 = I2C_HELPER_I2C1_OWN_ADDRESS_2;
		handle->Init.GeneralCallMode = I2C_HELPER_I2C1_GENERAL_CALL_MODE;
		handle->Init.NoStretchMode = I2C_HELPER_I2C1_NO_STRETCH_MODE;
		if (I2C_HELPER_I2C1_PEC_MODE == I2C_PECMODE_ENABLE)
		{
			enPEC = 1;
		}
		break;
	case HELPER_I2C2:
		handle->Instance = I2C2;
		handle->Init.ClockSpeed = I2C_HELPER_I2C2_CLOCK_SPEED;
		handle->Init.DutyCycle = I2C_HELPER_I2C2_DUTY_CYCLE;
		handle->Init.AddressingMode = I2C_HELPER_I2C2_ADDRESSING_MODE;
		handle->Init.OwnAddress1 = I2C_HELPER_I2C2_OWN_ADDRESS_1;
		handle->Init.DualAddressMode = I2C_HELPER_I2C2_DUAL_ADDRESSING;
		handle->Init.OwnAddress2 = I2C_HELPER_I2C2_OWN_ADDRESS_2;
		handle->Init.GeneralCallMode = I2C_HELPER_I2C2_GENERAL_CALL_MODE;
		handle->Init.NoStretchMode = I2C_HELPER_I2C1_NO_STRETCH_MODE;
		if (I2C_HELPER_I2C2_PEC_MODE == I2C_PECMODE_ENABLE)
		{
			enPEC = 1;
		}
		break;
	case HELPER_I2C3:
		handle->Instance = I2C3;
		handle->Init.ClockSpeed = I2C_HELPER_I2C3_CLOCK_SPEED;
		handle->Init.DutyCycle = I2C_HELPER_I2C3_DUTY_CYCLE;
		handle->Init.AddressingMode = I2C_HELPER_I2C3_ADDRESSING_MODE;
		handle->Init.OwnAddress1 = I2C_HELPER_I2C3_OWN_ADDRESS_1;
		handle->Init.DualAddressMode = I2C_HELPER_I2C3_DUAL_ADDRESSING;
		handle->Init.OwnAddress2 = I2C_HELPER_I2C3_OWN_ADDRESS_2;
		handle->Init.GeneralCallMode = I2C_HELPER_I2C3_GENERAL_CALL_MODE;
		handle->Init.NoStretchMode = I2C_HELPER_I2C3_NO_STRETCH_MODE;
		if (I2C_HELPER_I2C3_PEC_MODE == I2C_PECMODE_ENABLE)
		{
			enPEC = 1;
		}
		break;
	}

	status = HAL_I2C_Init(handle);
	/* MUST BE after the Init */
	if (status == HAL_OK && enPEC == 1)
	{
		/*Enable PEC on the handle*/
		handle->Instance->CR1 |= I2C_PECMODE_ENABLE;
	}

	return status;
}

/**
 * @brief 	This function de-initialize the peripheral referenced by the parameter
 * @param 	HELPER_I2Cx The internal handler's peripheral number to de-initialize
 * @return 	A status specified by the HAL_StatusTypeDef
 */
HAL_StatusTypeDef HELPER_I2C_DeInit(HELPER_I2C_TypeDef HELPER_I2Cx)
{
	switch (HELPER_I2Cx)
	{
	case HELPER_I2C1:
		return HAL_I2C_DeInit(&HELPER_I2C1_Handle);
		break;
	case HELPER_I2C2:
		return HAL_I2C_DeInit(&HELPER_I2C2_Handle);
		break;
	case HELPER_I2C3:
		return HAL_I2C_DeInit(&HELPER_I2C3_Handle);
		break;
	default:
		return 0;
	}
}
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/* HAL PORTING ********************************************************************/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
